# Выбор пола
GENDER_CHOICES = (
    (1, "Мужской"),
    (2, "Женский"),
)

# Выбор вида связи
TYPES_OF_COMMUNICATION_CHOICES = (
    (1, "Телефон"),
    (2, "Почта"),
)

# Выбор уровня образования
EDUCATION_LEVEL_CHOICES = (
    (1, "Среднее"),
    (2, "Среднее специальное"),
    (3, "Неоконченное высшее"),
    (4, "Высшее"),
    (5, "Бакалавр"),
    (6, "Магистр"),
    (7, "Кандидат наук"),
    (8, "Доктор наук"),
)

# Выбор города
CITY_CHOICES = (
    (1, "Санкт-Петербург"),
    (2, "Москва"),
)

# Выбор станции метро
STATION_METRO_CHOICES = (
    (1, "Сенная"),
    (2, "Адмиралтейская"),
    (3, "Площадь Восстания"),
    (4, "Невский проспект"),
)

# Выбор возможности переезда
POSSIBILITY_OF_TRANSFER_CHOICES = (
    (1, "Невозможен"),
    (2, "Возможен"),
    (3, "Желателен"),
)

# Выбор готовности к командировкам
BUSINESS_TRIPS_CHOICES = (
    (1, "Никогда"),
    (2, "Готов"),
    (3, "Иногда"),
)

# Выбор желаемого время в пути до работы
DESIRED_TIME_CHOICES = (
    (1, "Не имеет значения"),
    (2, "Не более часа"),
    (3, "Не более полутора часов"),
)

# Выбор категории прав
DRIVING_LISENSE_CHOICES = (
    (1, "Не указано"),
    (2, "A"),
    (3, "B"),
    (4, "C"),
    (5, "D"),
    (6, "E"),
    (7, "BE"),
    (8, "CE"),
    (9, "DE"),
    (10, "Tm"),
    (11, "Tb"),
)

# Выбор локали резюме ???
LOCALE_RESUME_CHOICES = (
    (1, "ru"),
    (2, "en"),
)

# Выбор специализации
SPECIALIZATION_CHOICES = (
    (1, "Специализация 1"),
    (2, "Специализация 2"),
)

# Выбор валюты для ЗП
CURRENCY_CHOICES = (
    (1, "₽"),
    (2, "$"),
    (3, "€"),
)

# Выбор валюты для ЗП
BUSYNESS_CHOICES = (
    (1, "Полная занятость"),
    (2, "Частичная занятость"),
    (3, "Проектная работа"),
    (4, "Волонтерство"),
    (5, "Стажировка"),
)

# Выбор валюты для ЗП
WORK_TIME_CHOICES = (
    (1, "Полный день"),
    (2, "Сменный график"),
    (3, "Гибкий график"),
    (4, "Удаленная работа"),
    (5, "Вахтовый метод"),
)

